In [145]:
import pandas as pd
import math

In [146]:
df=pd.read_csv("quotes.csv")

In [147]:
df.head()

,quotetext,character,title,author,year
0,Maybe 'okay' will be our 'always.,NaN,'The Fault in Our Stars','John Green',2012
1,I wonder what Piglet is doing. I wish I were t...,Pooh,Winnie-the-Pooh,A.A. Milne,1926
2,Be sure thy sin will find thee out.,NaN,And Then There Were None,Agatha Christie,1939
3,Best of an island is once you get there - you ...,NaN,And Then There Were None,Agatha Christie,1939
4,"But no artist, I now realize, can be satisfied...",NaN,And Then There Were None,Agatha Christie,1939

remove duplicates

In [148]:
df = df.drop_duplicates()

In [149]:
df.head()

,quotetext,character,title,author,year
0,Maybe 'okay' will be our 'always.,NaN,'The Fault in Our Stars','John Green',2012
1,I wonder what Piglet is doing. I wish I were t...,Pooh,Winnie-the-Pooh,A.A. Milne,1926
2,Be sure thy sin will find thee out.,NaN,And Then There Were None,Agatha Christie,1939
3,Best of an island is once you get there - you ...,NaN,And Then There Were None,Agatha Christie,1939
4,"But no artist, I now realize, can be satisfied...",NaN,And Then There Were None,Agatha Christie,1939

In [150]:
df.quotetext.size

2217

find duplicated quotetexts, take the one with the most info

In [151]:
df = df.sort_values(by=['character', 'title', 'author', 'year'], na_position='last')
df = df.drop_duplicates(subset='quotetext', keep='last')

In [152]:
df.tail(5)

,quotetext,character,title,author,year
1586,"We relinquished our freedom that day, and we w...",NaN,World War Z: An Oral History of the Zombie War,Max Brooks,2006
578,I have to remind myself to breathe -- almost t...,NaN,Wuthering Heights,Emily Brontë,1847
579,It was not the thorn bending to the honeysuckl...,NaN,Wuthering Heights,Emily Brontë,1847
580,She burned too bright for this world.,NaN,Wuthering Heights,Emily Brontë,1847
581,"Whatever our souls are made of, his and mine a...",NaN,Wuthering Heights,Emily Brontë,1847

In [153]:
df = df.sort_values(by=['author', 'year', 'title', 'character', 'quotetext'], na_position='last')

In [154]:
df.to_csv("quotes.csv", index=False)